DataProcessors/РабочееМестоПоварёнка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоПоварёнка</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлюдоГотово</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Блюда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Блюда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлюда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сюрприз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рецепт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБЖУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПриготовления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницаИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РабочееМестоПоварёнка/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаказПокупателяПриИзмененииНаСервере()
	
	Блюда.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяБлюда.Блюдо КАК Блюдо,
		|	ЗаказПокупателяБлюда.Количество КАК Количество,
		|	ЗаказПокупателяБлюда.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЗаказПокупателя.Блюда КАК ЗаказПокупателяБлюда
		|ГДЕ
		|	ЗаказПокупателяБлюда.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 СтрокаТаблицыБлюд = Блюда.Добавить();
		 ЗаполнитьЗначенияСвойств(СтрокаТаблицыБлюд, ВыборкаДетальныеЗаписи);
		 //СтрокаТаблицыБлюд.Блюдо = ВыборкаДетальныеЗаписи.Блюдо;
		 //СтрокаТаблицыБлюд.Количество = ВыборкаДетальныеЗаписи.Количество;
		 //СтрокаТаблицыБлюд.Комментарий = ВыборкаДетальныеЗаписи.Комментарий; 
		 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПокупателяПриИзменении(Элемент)
	ЗаказПокупателяПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БлюдаПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.Блюда.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Ингредиенты.Параметры.УстановитьЗначениеПараметра("КоличествоБлюд", ТекущиеДанные.Количество);
		Ингредиенты.Параметры.УстановитьЗначениеПараметра("ТекущееБлюдо", ТекущиеДанные.Блюдо);  
		
	Иначе
		
		Ингредиенты.Параметры.УстановитьЗначениеПараметра("ТекущееБлюдо", ПредопределенноеЗначение("Справочник.Блюда.ПустаяСсылка")); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСекундомер(Команда)
	
	Если Элементы.ЗапуститьСекундомер.Заголовок = "Остановить секундомер" Тогда
		
		ОтключитьОбработчикОжидания("ЗапуститьСекундомерОбработчик");
		Элементы.ЗапуститьСекундомер.Заголовок = "Запустить секундомер";
		
	Иначе              
		
		ПодключитьОбработчикОжидания("ЗапуститьСекундомерОбработчик", 1);
		Элементы.ЗапуститьСекундомер.Заголовок = "Остановить секундомер";
	
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСекундомерОбработчик() Экспорт
	
	Секундомер = Секундомер + 1;
	
КонецПроцедуры


&НаСервере
Процедура ИзменениеСтатусаЗаказаНаСервере(Статус)
	
	 ОбъектЗаказ = ЗаказПокупателя.ПолучитьОбъект();
	 ОбъектЗаказ.СтатусЗаказа = Перечисления.СтатусыЗаказов[Статус];
	 ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменениеСтатусаЗаказа(Команда)
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		
		Если Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Взять в работу" Тогда
		
			ИзменениеСтатусаЗаказаНаСервере("ВзятВРаботу");
			Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Готов";
			Элементы.ЗаказПокупателя.ТолькоПросмотр = Истина;
		
		Иначе  
		
			ИзменениеСтатусаЗаказаНаСервере("Готов");
			Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Взять в работу";
			Элементы.ЗаказПокупателя.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьЗаказ(Команда)
	
	Ответ = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтменитьЗаказЗавершение", ЭтотОбъект), "Ты уверен маленький поварёнок?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаказЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменениеСтатусаЗаказаНаСервере("Новый");
		Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Взять в работу";
		Элементы.ЗаказПокупателя.ТолькоПросмотр = Ложь; 
	КонецЕсли;
	
КонецПроцедуры
